[
  {
    "title": "Senior Software Engineer and Tech/Team Lead",
    "company": "Telia Company AB (Including TV4)",
    "location": "Stockholm",
    "period": "2022–present",
    "responsibilities": [
      "Streamlined development workflows and implemented best practices as Web Tech Lead, enhancing efficiency for streaming services Cmore and Telia Play",
      "Successfully migrated complex legacy web platforms to modern React architectures, improving performance and maintainability.",
      "Led the transition from REST to GraphQL as part of the modernization of both the Web and Smart TV platforms.",
      "Led the architecture and redevelopment of high-performance LG/Samsung TV apps, driving a parallel rewrite from a legacy stack to SolidJS while continuously shipping improvements to the Smart TV experience.",
      "Built a Cypress E2E framework for Smart TV and Web that runs the same test suite across platforms and markets (LG/Tizen + Web, SE/FI/NO).",
      "Introduced a domain-based architecture and standardized patterns across the codebase, reducing complexity and improving developer experience."
    ]
  },
  {
    "title": "Freelance Consultant",
    "company": "The Clever Company AB",
    "location": "Stockholm",
    "period": "2018–present",
    "responsibilities": [
      "Collaborated with prominent clients including TV4, Telia, RA Motor, SafePoint AB, Knivsta Motor, delivering tailored web and application solutions.",
      "Deliver end-to-end web and app solutions, from scoping and implementation to shipping to production.",
      "Currently building a platform for housing cooperatives (BRF) to simplify administration, communication, and document handling."
    ]
  },
  {
    "title": "Software Engineer",
    "company": "Telia Company AB",
    "location": "Stockholm",
    "period": "Sep 2018–Apr 2019",
    "responsibilities": [
      "Worked on the Telia Play streaming platform across web and mobile.",
      "Took a leading role in migrating the mobile hybrid app from AngularJS to React Native.",
      "Built and shipped features for both web and mobile to improve the overall user experience."
    ]
  },
  {
    "title": "Fullstack Developer",
    "company": "Will & Skill AB",
    "location": "Stockholm",
    "period": "Sep 2014–Sep 2018",
    "responsibilities": [
      "Worked in-house and as a consultant for clients such as Samsung, Nike, Ericsson, and Telia.",
      "Delivered end-to-end solutions and moved between frontend and backend depending on what the project needed.",
      "Built everything from public web experiences to internal tools (e.g. CRM/intranet-style systems), with a strong focus on UX."
    ]
  },
  {
    "title": "Web Developer",
    "company": "Swedish Armed Forces",
    "location": "Enköping",
    "period": "Jan 2014–Sep 2014",
    "responsibilities": [
      "Improved the Swedish Armed Forces web capabilities by enhancing and maintaining their online presence.",
      "Worked in a structured, security-conscious environment with a strong focus on stability and quality."
    ]
  }
]