[
  {
    "title": "Senior systemutvecklare och Tech/Team Lead",
    "company": "Telia Company AB (inkl. TV4)",
    "location": "Stockholm",
    "period": "2022–nuvarande",
    "responsibilities": [
      "Effektiviserade utvecklingsprocesser och införde gemensamma arbetssätt som Web Tech Lead för C More och Telia Play.",
      "Migrerade komplexa äldre webbplattformar till moderna arkitekturer med React, vilket förbättrade prestanda och underhållbarhet.",
      "Ledde övergången från REST till GraphQL i samband med modernisering av både webb- och Smart TV-plattformen.",
      "Tog fram arkitekturen och byggde om högpresterande LG- och Samsung-TV-appar, ledde en parallell omskrivning från en äldre teknikstack till SolidJS och levererade löpande förbättringar som stärkte användarupplevelsen på Smart TV.",
      "Byggde ett Cypress E2E-ramverk för Smart TV och webb som kör samma testsvit över plattformar och marknader (LG/Tizen + webb, SE/FI/NO).",
      "Införde en domänbaserad arkitektur och standardiserade mönster i kodbasen, vilket minskade komplexiteten och förbättrade utvecklarupplevelsen."
    ]
  },
  {
    "title": "Frilanskonsult",
    "company": "The Clever Company AB",
    "location": "Stockholm",
    "period": "2018–nuvarande",
    "responsibilities": [
      "Samarbetade med kunder som TV4, Telia, RA Motor, SafePoint AB och Knivsta Motor och levererade skräddarsydda webb- och applösningar.",
      "Levererar helhetslösningar inom webb och appar, från krav och implementation till lansering i produktion.",
      "Utvecklar en plattform för bostadsrättsföreningar för att förenkla administration, kommunikation och dokumenthantering."
    ]
  },
  {
    "title": "Systemutvecklare",
    "company": "Telia Company AB",
    "location": "Stockholm",
    "period": "Sep 2018–Apr 2019",
    "responsibilities": [
      "Arbetade med streamingtjänsten Telia Play för webb och mobil.",
      "Hade en ledande roll i migreringen av mobilappen från AngularJS till React Native.",
      "Utvecklade och lanserade funktioner för både webb och mobil för att förbättra användarupplevelsen."
    ]
  },
  {
    "title": "Fullstackutvecklare",
    "company": "Will & Skill AB",
    "location": "Stockholm",
    "period": "Sep 2014–Sep 2018",
    "responsibilities": [
      "Arbetade internt och som konsult för kunder som Samsung, Nike, Ericsson och Telia.",
      "Levererade helhetslösningar och arbetade med både frontend och backend beroende på projektets behov.",
      "Byggde allt från publika webbupplevelser till interna verktyg, med starkt fokus på användarupplevelse."
    ]
  },
  {
    "title": "Webbutvecklare",
    "company": "Försvarsmakten",
    "location": "Enköping",
    "period": "Jan 2014–Sep 2014",
    "responsibilities": [
      "Förbättrade Försvarsmaktens webbkapacitet genom vidareutveckling och underhåll av deras digitala närvaro.",
      "Arbetade i en strukturerad och säkerhetsmedveten miljö med fokus på stabilitet och kvalitet."
    ]
  }
]
